app/controllers/responses_controller.rb

SELECT "responses".* FROM "responses"
---
  def index
    @responses = Response.all

INSERT INTO "responses" ("answer_text", "survey_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["answer_text", "YES"], ["survey_id", 3], ["created_at", "2017-07-24 21:37:07.843553"], ["updated_at", "2017-07-24 21:37:07.843553"]]
---
  def create
    @response = @survey.responses.build(response_params)

    respond_to do |format|
      if @response.save

DELETE FROM "responses" WHERE "responses"."id" = $1  [["id", 1]]
---
  def destroy
    @response.destroy

SELECT  "responses".* FROM "responses" WHERE "responses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_response
      @response = Response.find(params[:id])

SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_survey
      @survey = Survey.find(params[:survey_id])