app/controllers/surveys_controller.rb

  def create
    @survey = Survey.new(survey_params)

    respond_to do |format|
      if @survey.save
---
INSERT INTO "surveys" ("name", "question_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "a"], ["question_text", "a"], ["created_at", "2017-07-24 21:19:41.690483"], ["updated_at", "2017-07-24 21:19:41.690483"]]

  def update
    respond_to do |format|
      if @survey.update(survey_params)
---
UPDATE "surveys" SET "question_text" = $1, "updated_at" = $2 WHERE "surveys"."id" = $3  [["question_text", "b"], ["updated_at", "2017-07-24 21:21:46.838664"], ["id", 2]]

  def destroy
    @survey.destroy
---
DELETE FROM "surveys" WHERE "surveys"."id" = $1  [["id", 1]]

    def set_survey
      @survey = Survey.find(params[:id])
---
SELECT  "surveys".* FROM "surveys" WHERE "surveys"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]